[root@R4 ~]# 
[root@R4 ~]# vtysh

Hello, this is Quagga (version 0.99.22.4).
Copyright 1996-2005 Kunihiro Ishiguro, et al.

R4# show  interface  
Interface eth0 is up, line protocol detection is disabled
  index 2 metric 1 mtu 1500 
  flags: <UP,BROADCAST,RUNNING,MULTICAST>
  HWaddr: 52:54:00:c9:c7:04
  inet 10.0.2.15/24 broadcast 10.0.2.255
  inet6 fe80::5054:ff:fec9:c704/64
Interface eth1 is up, line protocol detection is disabled
  index 3 metric 1 mtu 1500 
  flags: <UP,BROADCAST,RUNNING,MULTICAST>
  HWaddr: 08:00:27:d2:08:8d
  inet 172.16.12.14/30 broadcast 172.16.12.15
Interface eth2 is up, line protocol detection is disabled
  index 4 metric 1 mtu 1500 
  flags: <UP,BROADCAST,RUNNING,MULTICAST>
  HWaddr: 08:00:27:80:51:49
  inet 172.16.12.17/30 broadcast 172.16.12.19
Interface eth3 is up, line protocol detection is disabled
  index 5 metric 1 mtu 1500 
  flags: <UP,BROADCAST,RUNNING,MULTICAST>
  HWaddr: 08:00:27:91:62:4b
  inet 10.10.4.1/24 broadcast 10.10.4.255
Interface lo is up, line protocol detection is disabled
  index 1 metric 1 mtu 65536 
  flags: <UP,LOOPBACK,RUNNING>
  inet 127.0.0.1/8
  inet6 ::1/128
R4# show  running-config  
Building configuration...

Current configuration:
!
hostname Router
hostname ospfd
log stdout
!
password zebra
enable password zebra
!
interface eth0
 ipv6 nd suppress-ra
!
interface eth1
 ip address 172.16.12.14/30
 ip ospf cost 1000
 ipv6 nd suppress-ra
!
interface eth2
 ip address 172.16.12.17/30
 ipv6 nd suppress-ra
!
interface eth3
 ip address 10.10.4.1/24
 ipv6 nd suppress-ra
!
interface lo
!
router ospf
 ospf router-id 10.10.4.1
 network 10.10.4.1/24 area 0.0.0.4
 network 172.16.12.12/30 area 0.0.0.0
 network 172.16.12.16/30 area 0.0.0.0
!
ip forwarding
!
line vty
!
end
R4# 
R4# show  ip route  ospf  
Codes: K - kernel route, C - connected, S - static, R - RIP,
       O - OSPF, I - IS-IS, B - BGP, A - Babel,
       > - selected route, * - FIB route

O>* 10.10.1.0/24 [110/30] via 172.16.12.18, eth2, 00:29:18
O>* 10.10.2.0/24 [110/20] via 172.16.12.18, eth2, 07:40:11
O>* 10.10.3.0/24 [110/30] via 172.16.12.18, eth2, 06:31:00
O   10.10.4.0/24 [110/10] is directly connected, eth3, 11:51:44
O>* 172.16.12.0/30 [110/20] via 172.16.12.18, eth2, 00:29:18
O>* 172.16.12.4/30 [110/20] via 172.16.12.18, eth2, 06:31:00
O>* 172.16.12.8/30 [110/30] via 172.16.12.18, eth2, 01:16:54
O   172.16.12.12/30 [110/1000] is directly connected, eth1, 00:59:26
O   172.16.12.16/30 [110/10] is directly connected, eth2, 11:52:04
R4# show  ip ospf  neighbor  

    Neighbor ID Pri State           Dead Time Address         Interface            RXmtL RqstL DBsmL
10.10.3.1         1 Full/DR           37.690s 172.16.12.13    eth1:172.16.12.14        0     0     0
10.10.2.1         1 Full/Backup       34.682s 172.16.12.18    eth2:172.16.12.17        0     0     0
R4# exit
[root@R4 ~]# 
[root@R4 ~]# tracepath 10.10.1.1
 1?: [LOCALHOST]                                         pmtu 1500
 1:  172.16.12.18                                          1.744ms 
 1:  172.16.12.18                                          0.711ms 
 2:  10.10.1.1                                             1.226ms reached
     Resume: pmtu 1500 hops 2 back 3 
[root@R4 ~]# tracepath 10.10.3.1
 1?: [LOCALHOST]                                         pmtu 1500
 1:  172.16.12.18                                          1.910ms 
 1:  172.16.12.18                                          2.071ms 
 2:  10.10.3.1                                             2.720ms reached
     Resume: pmtu 1500 hops 2 back 2 
[root@R4 ~]# 

