[root@R1 ~]# sysctl -a | grep eth1.rp_filter
net.ipv4.conf.eth1.arp_filter = 0
[root@R1 ~]# sysctl -w 'net.ipv4.conf.eth1.rp_filter=2'
net.ipv4.conf.eth1.rp_filter = 2
[root@R1 ~]# sysctl -w 'net.ipv4.conf.eth2.rp_filter=2'
net.ipv4.conf.eth2.rp_filter = 2
[root@R1 ~]# vtysh

Hello, this is Quagga (version 0.99.22.4).
Copyright 1996-2005 Kunihiro Ishiguro, et al.

R1# conf t
R1(config)# R1(config)# log file /var/log/quagga/quagga.log
R1(config)# do show interface  
Interface eth0 is up, line protocol detection is disabled
  index 2 metric 1 mtu 1500 
  flags: <UP,BROADCAST,RUNNING,MULTICAST>
  HWaddr: 52:54:00:c9:c7:04
  inet 10.0.2.15/24 broadcast 10.0.2.255
  inet6 fe80::5054:ff:fec9:c704/64
Interface eth1 is up, line protocol detection is disabled
  index 3 metric 1 mtu 1500 
  flags: <UP,BROADCAST,RUNNING,MULTICAST>
  HWaddr: 08:00:27:c6:cf:a2
  inet6 fe80::c2d3:f00:be67:290c/64
Interface eth2 is up, line protocol detection is disabled
  index 4 metric 1 mtu 1500 
  flags: <UP,BROADCAST,RUNNING,MULTICAST>
  HWaddr: 08:00:27:a3:b0:98
  inet6 fe80::e29:2495:18d3:d896/64
Interface eth3 is up, line protocol detection is disabled
  index 5 metric 1 mtu 1500 
  flags: <UP,BROADCAST,RUNNING,MULTICAST>
  HWaddr: 08:00:27:03:41:70
  inet6 fe80::426c:2972:1f01:cc47/64
Interface lo is up, line protocol detection is disabled
  index 1 metric 1 mtu 65536 
  flags: <UP,LOOPBACK,RUNNING>
  inet 127.0.0.1/8
  inet6 ::1/128
R1(config)# interface  eth3
R1(config-if)# description  LAN3
R1(config-if)# ip address  10.10.1.1/24
R1(config-if)# no shutdown  
R1(config-if)# exit
R1(config)# do write  
Building Configuration...
Can't open configuration file /etc/quagga/zebra.conf.veiiTD.
Can't open configuration file /etc/quagga/ospfd.conf.3FAhxC.
[OK]
R1(config)# interface  eth1
R1(config-if)# ip address  172.16.12.1/30
R1(config-if)# exit
R1(config)# do write  
Building Configuration...
Can't open configuration file /etc/quagga/zebra.conf.A39lTZ.
Can't open configuration file /etc/quagga/ospfd.conf.5MPGxY.
[OK]
R1(config)# interface  eth2
R1(config-if)# ip address  172.16.12.10/30
R1(config-if)# exit
R1(config)# do write  
Building Configuration...
Can't open configuration file /etc/quagga/zebra.conf.SwVjkH.
Can't open configuration file /etc/quagga/ospfd.conf.p1lWYF.
[OK]
R1(config)# do show  interface  
Interface eth0 is up, line protocol detection is disabled
  index 2 metric 1 mtu 1500 
  flags: <UP,BROADCAST,RUNNING,MULTICAST>
  HWaddr: 52:54:00:c9:c7:04
  inet 10.0.2.15/24 broadcast 10.0.2.255
  inet6 fe80::5054:ff:fec9:c704/64
Interface eth1 is up, line protocol detection is disabled
  index 3 metric 1 mtu 1500 
  flags: <UP,BROADCAST,RUNNING,MULTICAST>
  HWaddr: 08:00:27:c6:cf:a2
  inet 172.16.12.1/30 broadcast 172.16.12.3
Interface eth2 is up, line protocol detection is disabled
  index 4 metric 1 mtu 1500 
  flags: <UP,BROADCAST,RUNNING,MULTICAST>
  HWaddr: 08:00:27:a3:b0:98
  inet 172.16.12.10/30 broadcast 172.16.12.11
  inet6 fe80::e29:2495:18d3:d896/64
Interface eth3 is up, line protocol detection is disabled
  Description: LAN3
  index 5 metric 1 mtu 1500 
  flags: <UP,BROADCAST,RUNNING,MULTICAST>
  HWaddr: 08:00:27:03:41:70
  inet 10.10.1.1/24 broadcast 10.10.1.255
Interface lo is up, line protocol detection is disabled
  index 1 metric 1 mtu 65536 
  flags: <UP,LOOPBACK,RUNNING>
  inet 127.0.0.1/8
  inet6 ::1/128
R1(config)# router ospf 
R1(config-router)# router-id  10.10.1.1   
R1(config-router)# network  10.10.1.1/24 area  1
R1(config-router)# network  172.16.12.0/30 area  0
R1(config-router)# network  172.16.12.8/30 area  0
R1(config-router)# exit 
R1(config)# do write  
Building Configuration...
Can't open configuration file /etc/quagga/zebra.conf.DPDpa8.
Can't open configuration file /etc/quagga/ospfd.conf.oiOjP6.
[OK]
R1(config)# interface  eth1
R1(config-if)# ospf  cost 100
R1(config-if)# exit
R1(config)# do write  
Building Configuration...
Can't open configuration file /etc/quagga/zebra.conf.PlZhsw.
Can't open configuration file /etc/quagga/ospfd.conf.xkmh8u.
[OK]
R1(config)# do show  running-config  
Building configuration...

Current configuration:
!
hostname Router
log file /var/log/quagga/quagga.log
hostname ospfd
log stdout
!
password zebra
enable password zebra
!
interface eth0
 ipv6 nd suppress-ra
!
interface eth1
 ip address 172.16.12.1/30
 ip ospf cost 100
 ipv6 nd suppress-ra
!
interface eth2
 ip address 172.16.12.10/30
 ipv6 nd suppress-ra
!
interface eth3
 description LAN3
 ip address 10.10.1.1/24
 ipv6 nd suppress-ra
!
interface lo
!
router ospf
 ospf router-id 10.10.1.1
 network 10.10.1.1/24 area 0.0.0.1
 network 172.16.12.0/30 area 0.0.0.0
 network 172.16.12.8/30 area 0.0.0.0
!
ip forwarding
!
line vty
!
end
R1(config)# exit
R1# show  ip route  ospf  
Codes: K - kernel route, C - connected, S - static, R - RIP,
       O - OSPF, I - IS-IS, B - BGP, A - Babel,
       > - selected route, * - FIB route

O   10.10.1.0/24 [110/10] is directly connected, eth3, 00:36:29
O>* 10.10.2.0/24 [110/30] via 172.16.12.9, eth2, 00:04:01
O>* 10.10.3.0/24 [110/20] via 172.16.12.9, eth2, 00:11:22
O>* 10.10.4.0/24 [110/40] via 172.16.12.9, eth2, 00:04:01
O   172.16.12.0/30 [110/30] via 172.16.12.9, eth2, 00:04:01
O>* 172.16.12.4/30 [110/20] via 172.16.12.9, eth2, 00:04:01
O   172.16.12.8/30 [110/10] is directly connected, eth2, 00:11:27
O>* 172.16.12.12/30 [110/1010] via 172.16.12.9, eth2, 00:10:14
O>* 172.16.12.16/30 [110/30] via 172.16.12.9, eth2, 00:04:01
R1# 
R1# show  ip ospf  neighbor  

    Neighbor ID Pri State           Dead Time Address         Interface            RXmtL RqstL DBsmL
10.10.2.1         1 Full/DR           30.933s 172.16.12.2     eth1:172.16.12.1         0     0     0
10.10.3.1         1 Full/DR           39.342s 172.16.12.9     eth2:172.16.12.10        0     0     0
R1# 
R4# exit
[root@R1 ~]# ip a
1: lo: <LOOPBACK,UP,LOWER_UP> mtu 65536 qdisc noqueue state UNKNOWN group default qlen 1000
    link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00
    inet 127.0.0.1/8 scope host lo
       valid_lft forever preferred_lft forever
    inet6 ::1/128 scope host 
       valid_lft forever preferred_lft forever
2: eth0: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc pfifo_fast state UP group default qlen 1000
    link/ether 52:54:00:c9:c7:04 brd ff:ff:ff:ff:ff:ff
    inet 10.0.2.15/24 brd 10.0.2.255 scope global noprefixroute dynamic eth0
       valid_lft 80926sec preferred_lft 80926sec
    inet6 fe80::5054:ff:fec9:c704/64 scope link 
       valid_lft forever preferred_lft forever
3: eth1: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc pfifo_fast state UP group default qlen 1000
    link/ether 08:00:27:c6:cf:a2 brd ff:ff:ff:ff:ff:ff
    inet 172.16.12.1/30 brd 172.16.12.3 scope global eth1
       valid_lft forever preferred_lft forever
4: eth2: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc pfifo_fast state UP group default qlen 1000
    link/ether 08:00:27:a3:b0:98 brd ff:ff:ff:ff:ff:ff
    inet 172.16.12.10/30 brd 172.16.12.11 scope global eth2
       valid_lft forever preferred_lft forever
5: eth3: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc pfifo_fast state UP group default qlen 1000
    link/ether 08:00:27:03:41:70 brd ff:ff:ff:ff:ff:ff
    inet 10.10.1.1/24 brd 10.10.1.255 scope global eth3
       valid_lft forever preferred_lft forever
[root@R1 ~]# 
[root@R1 ~]# cat /etc/quagga/zebra.conf 
! -*- zebra -*-
!
! zebra sample configuration file
!
! $Id: zebra.conf.sample,v 1.1 2002/12/13 20:15:30 paul Exp $
!
hostname Router
password zebra
enable password zebra
!
! Interface's description. 
!
!interface lo
! description test of desc.
!
!interface sit0
! multicast

!
! Static default route sample.
!
!ip route 0.0.0.0/0 203.181.89.241
!

!log file zebra.log
[root@R1 ~]# cat /etc/quagga/ospfd.conf 
! -*- ospf -*-
!
! OSPFd sample configuration file
!
!
hostname ospfd
password zebra
!enable password please-set-at-here
!
!router ospf
!  network 192.168.1.0/24 area 0
!
log stdout
[root@R1 ~]# 
[root@R1 ~]# tracepath 10.10.4.1
 1?: [LOCALHOST]                                         pmtu 1500
 1:  172.16.12.9                                           2.670ms 
 1:  172.16.12.9                                           1.578ms 
 2:  172.16.12.5                                           2.227ms 
 3:  10.10.4.1                                             3.313ms reached
     Resume: pmtu 1500 hops 3 back 3 
[root@R1 ~]# tracepath 10.10.3.1
 1?: [LOCALHOST]                                         pmtu 1500
 1:  10.10.3.1                                             1.881ms reached
 1:  10.10.3.1                                             0.850ms reached
     Resume: pmtu 1500 hops 1 back 1 
[root@R1 ~]# tracepath 10.10.2.1
 1?: [LOCALHOST]                                         pmtu 1500
 1:  172.16.12.9                                           1.707ms 
 1:  172.16.12.9                                           1.836ms 
 2:  10.10.2.1                                             2.216ms reached
     Resume: pmtu 1500 hops 2 back 1 
[root@R1 ~]# 


